import { Container, Divider } from "@mui/material";
import React from "react";
import Photo1 from "../../img/تبرعات.jpg";

export default function Donations() {
  return (
    <div>
      <Container sx={{ marginBottom: 5 }}>
        <h1>كيف تتبرع لدعم أهالي غزة؟.. 4 حسابات بنكية</h1>
        <Divider />

        <img width={"80%"} alt="" src={Photo1} style={{ margin: "27px 0" }} />
        <p>
          تعاطف دولي تجاه أهالي غزة الفلسطينية بعد تعرض القطاع بأكمله لقصف
          إسرائيلي وقطع المياه والكهرباء وهو ما دفع البعض للتساؤل والبحث عن
          طريقة تمكنهم من إرسال التبرعات لإغاثة ونجدة الأهالي بعد الإعلان عن نقص
          الأدوية وغيرها من المسلتزمات اليومية، الأمر الذي دفع مبادرة «حياة
          كريمة» لإطلاق مبادرة تمكن المواطنين من التبرع الفوري. وفي هذا الصدد،
          توضح الوطن كيف التبرع لدعم أهالي غزة من خلال توفير حياة كريمة عدة
          قنوات للتبرع من خلال حملة «كتفنا في كتف أهلنا في فلسطين»، من أجل دعم
          ومساندة الشعب الفلسطيني. ووفقًا لمبادرة «حياة كريمة»، فإن المؤسسة
          ستوجه التبرعات لصالح دعم الشعب الفلسطيني، لجمع التبرعات لتقديم كافة
          أوجه الدعم الممكنة للوقوف بجانب الشعب الفلسطيني، ويمكن التبرع كالتالي:
        </p>
        <h3>
          <li> البنك التجاري الدولي 100058267915.</li>
          <li> بنك مصر1160001000018501</li>
          <li>البنك الأهلي المصري 1003171263956002025</li>
          <li>البنك العربي الافريقي الدولي 1104533910020205</li>
          <li>رقم حساب جمعية الهلال الأحمر المصري بالجنيه المصري: 911111</li>
          <li>
            رقم حساب جمعية الهلال الأحمر المصري بالدولار الأمريكي: 30/601/1065
          </li>
        </h3>
      </Container>
    </div>
  );
}
