import * as React from "react";
import Accordion from "@mui/material/Accordion";
import AccordionDetails from "@mui/material/AccordionDetails";
import AccordionSummary from "@mui/material/AccordionSummary";
import Typography from "@mui/material/Typography";
import ExpandMoreIcon from "@mui/icons-material/ExpandMore";
import { Container, Divider } from "@mui/material";

export default function ControlledAccordions() {
  const [expanded, setExpanded] = React.useState(false);

  const handleChange = (panel) => (event, isExpanded) => {
    setExpanded(isExpanded ? panel : false);
  };

  return (
    <>
      <div style={{}}>
        {" "}
        <Container sx={{marginBottom:5}}>
          <div className="h1" style={{ textAlign: "center" }}>
            {" "}
            <h1>تاريخ فلسطين الحبيبة</h1>
          </div>
          <Divider />
          <h3>تعريف سريع ...</h3>
          <div>
            <p>
              <span
                style={{
                  fontWeight: "bold",
                  fontSize: "18px",
                  color: "#0288d1",
                }}
              >
                فلسطين أو فلسطين التاريخية{" "}
              </span>
              ( بالإنجليزية والفرنسية: Palestine ؛ باليونانية: Παλαιστίνη ؛
              باللاتينية :Palaestina ؛ بالعبرية : פּלשׂתינה أو פלסטין حسب
              السياق). هي جزء طبيعي من بلاد الشام ومنطقة تاريخية في قلب الشرق
              الأوسط، وهي محاطة اليوم ببلدان عربية وكذلك جزء كبير من سكانها من
              العرب. أما الجزء الآخر من سكانها هم من اليهود المهاجرين وأبناء
              شعوب أخرى. تقع شرق البحر الأبيض المتوسط تصل بين غربي آسيا وشمالي
              أفريقيا بوقوعها، وشبه جزيرة سيناء، عند نقطة إلتقاء القارتين.
              وتحتوي هذه المنطقة على عدد كبير من المدن الهامة تاريخياً ودينياً
              بالنسبة للديانات التوحيدية الثلاث، وعلى رأسها القدس و الخليل وبيت
              لحم والناصرة وأريحا وطبريا. تمتلك المنطقة أرضاً متنوّعة جداً،
              وتقسم جغرافياً إلى أربع مناطق، وهي من الغرب إلى الشرق السهل
              الساحلي، التلال، الجبال (جبال الجليل، جبال نابلس، جبال القدس
              ووجبال الخليل) والأغوار (غور الأردن). في أقصى الجنوب هناك صحراء
              النقب. بين جبال نابلس وجبال الجليل يقع مرج بن عامر ويقطع جبل
              الكرمل، الذي يمتد من جبال نابلس شمالا غربا، السهل الساحلي. تتراوح
              الارتفاعات من 417 متراً تحت مستوى البحر في البحر الميت (وهي أخفض
              نقطة على سطح اليابسة في العالم) إلى 1204 متراً فوق مستوى البحر في
              قمة جبل الجرمق (جبل ميرون كما يسمى في إسرائيل). من ناحية جغرافية
              ونباتية تمتد منطقة فلسطين عبر حدود لبنان والأردن لتشمل المنطقة
              جنوبي نهر الليطاني والمنطقة المجاورة لنهر الأردن من الشرق، ولكن
              منذ عشرينات القرن العشرين، أي منذ الانتداب البريطاني على فلسطين
              يستخدم مصطلح فلسطين إشارة إلى المنطقة الممتدة على 26990 كم مربع،
              ما بين نهر الأردن شرقاً والبحر الأبيض المتوسط غرباً، وبين الحدود
              اللبنانية الجنوبية المرسومة عام 1923 شمالاً ورأس خليج العقبة
              جنوباً. يقدر عدد السكان القاطنين اليوم ضمن هذه الحدود 11 مليون
              نسمة تقريباً، وتقدر نسبة العرب من بينهم بنحو 47%[1] سياسياً، منذ
              تأسيس السلطة الوطنية الفلسطينية عام1993، فإن اسم فلسطين قد يستخدم
              دولياً ضمن بعض السياقات للإشارة أحياناً إلى أراضي السلطة
              الفلسطينية[2]. أما لقب فلسطيني فيشير اليوم، وخاصة منذ 1948، إلى
              السكان العرب في جميع أنحاء المنطقة (بينما يفضل السكان اليهود عدم
              استخدام هذا اللقب إشارة إلى أنفسهم)[3]. من الناحية التاريخية أشار
              اسم فلسطين إلى عدد من الكيانات السياسية أو المحافظات الإدارية التي
              وقعت في هذه المنطقة منذ القرن الثاني للميلاد. وكانت أولاها "ولاية
              سوريا الفلسطينية" التي كانت تابعة للإمبراطورية الرومانية. بين 1917
              و1948 أشار اسم فلسطين إلى منطقة الانتداب البريطاني على فلسطين.
              أيام الدولة العثمانية كان اسم فلسطين يستخدم كمصطلح جغرافي فقط في
              حين تم تقسيم فلسطين إدارياً إلى عدة وحدات إدارية.
            </p>
          </div>
          <Divider />
          <div>
            <h3>التسميه و الحدود</h3>
            <p>
              كان أول من استخدم اسم فلسطين إشارة إلى جنوبي بلاد الشام هو المؤرخ
              الإغريقي هيرودوت في مؤلفاته من القرن ال5 ق.م. وقد استخدم هيرودوت
              اسم فلسطين كمصطلح جغرافي، حيث أشار إلى منطقتي بلاد الشام وبلاد
              الرافدين ك"سوريا" وإلى جنوبها ك"فلسطين" (Παλαιστινη
              "پَلَيْسْتِينِيه") أو "سوريا الفلسطينية". وعلى ما يبدو استعار
              هيرودوت هذا الاسم من اسم "پلشت" الذي أشار إلى الساحل الجنوبي ما
              بين يافا ووادي العريش حيث وقعت المدن الفلستينية. وكان الفلستينيون
              من شعوب البحر ومن أبرز الشعوب التي عاشت في منطقة فلسطين من القرن
              ال12 ق.م. ولمدة 500 عام على الأقل. ولم يستخدم اسم فلسطين كاسم
              منطقة ذات حدود سياسية معينة إلا في القرن الثاني للميلاد عندما ألغت
              سلطات الإمبراطورية الرومانية "ولاية يهوذا" (Provincia Iudaea) إثر
              التمرد اليهودي عليهم عام 132 للميلاد وإقامة "ولاية سوريا
              الفلسطينية" (Provincia Syria Palestinae) محلها.[بحاجة لمصدر] من
              الناحية الطوبوغرافية ونباتية يمكن استخدام معايير مختلفة لتحديد
              منطقة فلسطين، ولكنه يمكن بشكل عام وصفها كالمنطقة الممتدة من نهر
              الليطاني في لبنان شمالا إلى رأس خليج العقبة جنوبا، ومن البحر
              الأبيض المتوسط غربا إلى الضواحي الغربية للبادية السورية في الأردن
              شرقا. ويمكن أيضا اعتبار صحراء النقب جزءا طبيعيا من شبه جزيرة سيناء
              وعدم شموله بمنطقة فلسطين جغرافيا. والحدود المشار إليها اليوم كحدود
              فلسطين التاريخية هي نتيجة سلسلة من المفاوضات والاتفاقيات بين
              الإمبراطوريات التي سيطرت على الشرق الأوسط في مطلع القرن الـ 20
              والتي أدت كذلك إلى تصميم الحدود السياسية في عموم الشرق الأوسط.
              حدود فلسطين التاريخية ("من النهر إلى البحر") هي البحر الأبيض
              المتوسط غربا، "خط رفح العقبة" الذي يفصلها عن سيناء من الجنوب
              الغربي، رأس خليج العقبة جنوبا، وادي عربه، البحر الميت ونهر الأردن
              شرقا، ومنحدر هضبة الجولان قرب شواطئ بحيرة طبريا الشرقية ومسار نهر
              الأردن الشمالي في الشمال الشرقي. ويحد فلسطين شمالا لبنان في خط
              متعرج يبتديء غربا برأس الناقورة على البحر الأبيض المتوسط، ثم يتجه
              شرقا إلى قرية يارون، فينعطف شمالا حتى المكان حيث وقعت في الماضي
              قريتي المالكية وقَدَس وحيث تقع بلدة المطلة ثم شرقا إلى تل القاضي
              وغربا إلى نقطة قرب منبع بانياس. ويشكل مسار الحدود الشمالي الشرقي
              صورة إصبع حيث أطلق على هذه المنطقة اسم "إصبع الجليل".
            </p>
          </div>
          <Divider />
          <div>
            <h3>حرب 1948</h3>

            <p>
              حرب 1948 هي حرب نشبت في فلسطين بين كل من المملكة الأردنية الهاشمية
              والمملكة المصرية ومملكة العراق وسوريا ولبنان والمملكة العربية
              السعودية ضد المليشيات الصهيونية المسلحة في فلسطين والتي تشكّلت من
              البلماخ والإرجون والهاجاناه والشتيرن والمتطوعين اليهود من خارج
              حدود الانتداب البريطاني على فلسطين. كانت المملكة المتحدة قد أعلنت
              إنهاء انتدابها على فلسطين وغادرت تبعا لذلك القوات البريطانية من
              منطقة الانتداب، وأصدرت الأمم المتحدة قرارا بتقسيم فلسطين لدولتين
              يهودية وعربية الأمر الذي عارضته الدول العربية وشنّت هجوما عسكريا
              لطرد المليشيات اليهودية من فلسطين في مايو 1948 استمر حتى مارس
              1949. خلال الحرب، خططت بريطانيا سرًا لغزو أردني كامل للضفة الغربية
              على أمل القضاء على إمكانية إنشاء دولة فلسطينية بقيادة أمين
              الحسيني، والتي كانت ناجحة وأمنت النفوذ البريطاني داخل شرق الأردن
              على الرغم من أن دورهم قد خلق نتيجة غير مرغوب فيها في مستقبل الشرق
              الأوسط.
            </p>
            <div>
              <Accordion
                expanded={expanded === "panel1"}
                onChange={handleChange("panel1")}
              >
                <AccordionSummary
                  expandIcon={<ExpandMoreIcon />}
                  aria-controls="panel1bh-content"
                  id="panel1bh-header"
                >
                  <Typography sx={{ width: "33%", flexShrink: 0 }}>
                    تقسيم فلسطين{" "}
                  </Typography>
                  <Typography sx={{ color: "text.secondary" }}>
                    وافقت الجمعية العامة للأمم المتحدة على قرار تقسيم فلسطين إلى
                    دولتين يهودية وعربية (فلسطينية)
                  </Typography>
                </AccordionSummary>
                <AccordionDetails>
                  <Typography>
                    في 29 نوفمبر 1947 وافقت الجمعية العامة للأمم المتحدة على
                    قرار تقسيم فلسطين إلى دولتين يهودية وعربية (فلسطينية) وتدويل
                    منطقة القدس (أي جعلها منطقة دولية لا تنتمي لدولة معينة
                    ووضعها تحت حكم دولي)، وكان قرار التقسيم كالتالي: 56%:
                    لليهود. 43%: للعرب. 1%: منطقة القدس (وهي منطقة دولية ووضعت
                    تحت الانتداب بإدارة الأمم المتحدة)، وقد شمل القرار على
                    الحدود بين الدولتين الموعودتين وحدّد مراحل في تطبيقه وتوصيات
                    لتسويات اقتصادية بين الدولتين. وبشكل عام، رحّب الصهاينة
                    بمشروع التقسيم، بينما شعر العرب والفلسطينيون بالإجحاف. ولقد
                    كانت عصبة التحرر الوطني، وهي مجموعة إميل حبيبي، وإميل توما
                    وآخرين من العرب الذين تركوا الحزب الشيوعي الفلسطيني، هي
                    الحركة العربية الفلسطينية الوحيدة التي دعت إلى قبول خطة
                    التقسيم. تصاعدت حدّة القتال بعد قرار التقسيم في بداية عام
                    1948، وتشكّل جيش الإنقاذ بقيادة فوزي القاوقجي، وبحلول شهر
                    يناير من عام 1948 كانت منظّمتا الأرجون والشتيرن قد لجأتا إلى
                    استخدام السيارات المفخخة، حيث في 4 يناير تم تفجير مركز
                    الحكومة في يافا مما أسفر عن مقتل 26 مدني فلسطيني، وفي شهر
                    مارس من عام 1948 نسف المقاتلون الفلسطينيون غير النظاميين
                    مبنى مقر الوكالة اليهودية في مدينة القدس مما أدّى إلى مقتل
                    11 يهوديا وجرح 86. وفي يوم 12 أبريل 1948 أقرّت الجامعة
                    العربية إرسال الجيوش العربية إلى فلسطين وأكدت اللجنة
                    السياسية أن الجيوش لن تدخل قبل انسحاب بريطانيا المُزمع في 15
                    مايو. عَيّن ين جوريون يغال يادين مسؤولا عن إيجاد خطة للتحضير
                    للتدخل العربي المعلن. وخرجت تحليلات يغال يادين بالخطة دالت،
                    والتي وضعت حيّز التنفيذ منذ شهر نيسان/أبريل وما تلاه. ترسم
                    «الخطة دالت» الجزء الثاني من مراحل الحرب، حيث انتقلت فيها
                    الهاجاناه من موقع «الدفاع» إلى موقع الهجوم.
                  </Typography>
                </AccordionDetails>
              </Accordion>
              <Accordion
                expanded={expanded === "panel2"}
                onChange={handleChange("panel2")}
              >
                <AccordionSummary
                  expandIcon={<ExpandMoreIcon />}
                  aria-controls="panel2bh-content"
                  id="panel2bh-header"
                >
                  <Typography sx={{ width: "33%", flexShrink: 0 }}>
                    القوات العربية
                  </Typography>
                  <Typography sx={{ color: "text.secondary" }}>
                    شكّلت المملكة المصرية أكثرية القوات العربية عددا حيث أرسلت
                    10,000 جندي
                  </Typography>
                </AccordionSummary>
                <AccordionDetails>
                  <Typography>
                    شكّلت المملكة المصرية أكثرية القوات العربية عددا حيث أرسلت
                    10,000 جندي تحت قيادة اللواء أحمد علي المواوي، تليها المملكة
                    الأردنية الهاشمية بإجمالي 4,500 جندي في 4 أفواج وبطاريتا
                    مدفعية (بمجموع 8 مدافع 25 رطل بقيادة غلوب باشا. وشاركت
                    المملكة العراقية بالحرب بقوة تضم 2,500 فرد بقيادة العميد
                    محمد الزبيدي وأرسلت القوة إلى شرق الأردن في 29 إبريل 1948
                    وهي تتألف من فوج مشاة ميكانيكي وفوجان مشاة وكتيبة مدرعة (36
                    دبابة خفيفة) وكتيبة مدفعية ميدان (12 مدفع 25 رطل) وبطارية
                    مدفعية مضادة للطائرات. شاركت سوريا بقوة تضم 1,876 فردا
                    بقيادة العقيد عبد الوهاب الحكيم وتألّفت تشكيلات القوات
                    السورية لواء مُشاة (مؤلف من كتيبتين) وكتيبة مشاه ميكانيكية
                    (تضم سرية مؤلف من 17 عربة مصفحة طراز مارمون وسرية من 17 عربة
                    مصفحة (6 مصفحات مارمون و11 مصفحة دودج محلية التصفيح وسرية
                    دبابات رينو آر-35 من 13 دبابة وسرية مشاة محمولة من 140 جندي)
                    إضافة كتيبة مدفعية من عيار 75 مم. شارك لبنان بكتيبتي مشاة في
                    كل كتيبة 450 جندي وفصيل مدفعية هاون ومدافع رشاشة إضافة
                    بطارية مدفعية من 4 مدافع عيار 105 ملم. و4 عربات مدرعة و4
                    دبابات خفيفة 7 طن ومجموعة مستشفى ميدان وقد تحشدت هذه القوات
                    في مراكز تجمعها في الحدود اللبنانية الجنوبية ولقد بدأت
                    الهجوم بدأً من 1 مايو 1948، وأوكلت مهمة قيادة القوات
                    اللبنانية للعميد فؤاد شهاب. شاركت المملكة العربية السعودية
                    بقوة بقيادة العقيد سعيد بك الكردي ووكيله القائد عبد الله بن
                    نامي وبلغ عدد ضباط وأفراد الفرقة قرابة الثلاثة آلاف ومائتا
                    رجل. 1 ـ وصلت الدفعة الأولى إلى غزة يوم 27 مايو 1948 م تضم
                    27 ضابطاً و339 رتب أخرى. 2 ـ وصلت الدفعة الثانية إلى غزة يوم
                    30 مايو 1948 م وتضم 19 ضابطاً و35 رتب أخرى. 3 ـ وصلت الدفعة
                    الثالثة إلى غزة يوم 15 يونيو 1948 م وتضم 10 ضباط و329 رتب
                    أخرى. وكان بحوزة القوة العسكرية السعودية 36 هاون 3 بوصة، 34
                    مدفع براوننج، 72 رشاش برف، 10 رشاشات عيار 50، 10 رشاشات
                    هونشكس، 750 بندقية 303 بوصة، 10 عربات مدرعة همير، وكانت
                    ذخيرة هذه القوة نحو 21600 قذيفة هاون 3 بوصة، 165000 طلقة 30.
                    كذلك شارك جيش الجهاد المقدس وجيش الإنقاذ بالحرب حيث قامت
                    الجامعة العربية بأول خطوة لتوفير الاحتياجات الدفاعية
                    للفلسطينيين في سبتمبر 1947 حيث أمرت بتشكيل اللجنة العسكرية
                    الفنية وذلك لتقييم المتطلبات الدفاعية الفلسطينية، خرج
                    التقرير باستنتاجات تؤكد قوة الصهاينة وتؤكد أنه ليس
                    للفلسطينيين من قوى بشرية أو تنظيم أو سلاح أو ذخيرة يوازي أو
                    يقارب ما لدى الصهاينة، وحث التقرير الدول العربية على «تعبئة
                    كامل قوتها». قامت الجامعة بتخصيص مبلغ مليون جنيه استرليني
                    للجنة الفنية، وقبل إصدار قرار التقسيم حذّر اللواء إسماعيل
                    صفوت رئيس اللجنة الفنية أنه «بات من المستحيل التغلّب على
                    القوات الصهيونية باستخدام قوات غير نظامية» وأنه «ليس
                    باستطاعة الدول العربية أن تتحمّل حربا طويلة»، وبعد قرار
                    التقسيم اجتمعت الدول العربية في القاهرة بين 8 و17 ديسمبر
                    1947 وأعلنت أن تقسيم فلسطين غير قانوني وتقرّر أن تضع 10,000
                    بندقية و3,000 متطوع (وهو ما أصبح يعرف بجيش الإنقاذ) بينهم
                    500 فلسطيني ومبلغ مليون جنية في تصرف اللجنة العسكرية الفنية.
                    وتكونت وحدات جيش الإنقاذ من ثمانية أفواج: 1. فوج اليرموك
                    الأول: وتكوّن من ثلاث سرايا بمجموع 500 فرد. 2. فوج اليرموك
                    الثاني: وتكون ثلاث سرايا بمجموع 430 فرد. 3. فوج اليرموك
                    الثالث: وتكون من سريتين 250 فرد. 4. فوج حطين: ثلاث سرايا
                    وعدد أفرادها 500. 5. فوج الحسين (الفوج العراقي): ثلاث سرايا
                    وعدد الأفراد 500. 6. فوج جبل الدروز: وتكوّن من ثلاث سرايا
                    بلغ عدد أفرادها 500. 7. فوج القادسية: وتكوّن من ثلاث سرايا
                    بلغ عدد أفرادها 450. إضافة لأربع سرايا مستقلة غير تابعة لأي
                    فوج، عدد أفرادها حوالي 450 فرد
                  </Typography>
                </AccordionDetails>
              </Accordion>
              <Accordion
                expanded={expanded === "panel3"}
                onChange={handleChange("panel3")}
              >
                <AccordionSummary
                  expandIcon={<ExpandMoreIcon />}
                  aria-controls="panel3bh-content"
                  id="panel3bh-header"
                >
                  <Typography sx={{ width: "33%", flexShrink: 0 }}>
                    الاحتلال الصهيوني (إسرائيل)
                  </Typography>
                  <Typography sx={{ color: "text.secondary" }}>
                    بحسب المصادر الرسمية الإسرائيلية قرابة 45,300 فرد،
                  </Typography>
                </AccordionSummary>
                <AccordionDetails>
                  <Typography>
                    بلغت أعداد منظمة الهاجاناه في ربيع عام 1947 بحسب المصادر
                    الرسمية الإسرائيلية قرابة 45,300 فرد، ويدخل في هذه الأعداد
                    أعضاء البالماخ البالغ عددهم نحو 2,200 فرد، وحينما بدأت
                    التعبئة في أعقاب قرار التقسيم انضم إلى الهاجاناه نحو 30 ألف
                    مجند من يهود فلسطين و20 ألف آخرين من يهود أوروبا حتى إعلان
                    قيام دولة إسرائيل في مساء 14 مايو 1948. حينما اندلعت الحرب
                    في فلسطين ارتفعت أعداد الهاجاناه في الأسبوع الأول من يونيو
                    1948 إلى نحو 107,300 نتيجة لرفع سن التجنيد إلى 35 عاماً
                    اعتباراً من 4 مايو مما أضاف نحو 12 ألف مجند زيادة على أعداد
                    الهجناه في 14 مايو.
                  </Typography>
                </AccordionDetails>
              </Accordion>
              <Accordion
                expanded={expanded === "panel4"}
                onChange={handleChange("panel4")}
              >
                <AccordionSummary
                  expandIcon={<ExpandMoreIcon />}
                  aria-controls="panel4bh-content"
                  id="panel4bh-header"
                >
                  <Typography sx={{ width: "33%", flexShrink: 0 }}>
                    بدء الحرب
                  </Typography>
                  <Typography sx={{ color: "text.secondary" }}>
                    وصلت الجيوش العربية من مصر وسوريا والعراق والأردن والسعودية
                    ولبنان إلى فلسطين{" "}
                  </Typography>
                </AccordionSummary>
                <AccordionDetails>
                  <Typography>
                    وصلت الجيوش العربية من مصر وسوريا والعراق والأردن والسعودية
                    ولبنان إلى فلسطين وهاجمت القوات العربية المستعمرات الصهيونية
                    المقامة في فلسطين وهاجم القوات المصرية تجمعي كفار داروم
                    ونيريم الصهيونيتين في النقب. كانت أقوى الجبهات وأهمّها هي
                    الجبهة الأردنية الإسرائيلية فقد عبرت ثلاثة ألوية تابعة للجيش
                    الأردني نهر الأردن إلى فلسطين في 16 مايو 1948 ثم ازدادوا إلى
                    أربعة مع مُضي الحرب، بالإضافة إلى عدّة كتائب مشاة. سكان الحي
                    اليهودي في القدس يفرون منه في 28 أيار / مايو 1948 بعد سقوطه
                    بيد القوات الأردنية مساء ذلك اليوم. الملك عبد الله الأول بن
                    الحسين يزور مدينة القدس في 29 أيار/مايو 1948 متطوعون سوريون
                    أثناء الحرب كان هناك حوالي خمسين ضابط بريطاني يخدم في الجيش
                    العربي الأردني، الذي كان على درجة عالية من التدريب. وكان
                    الجيش العربي الأردني ربما أفضل الجيوش المتحاربة من الناحية
                    التكتيكية. حيث عانت باقي الجيوش من ضعف شديد في اتخاذ
                    القرارات الحاسمة على المستوى الإستراتيجي والقيام بمناورات
                    تكتيكية (Tactical maneuvers), أنظر. وقد رافق الجيش العربي
                    فريق من الصحفيين الأجانب من ضمنهم مراسل مجلة التايم. قام
                    كلوب باشا بتقسيم القوات الأردنية كالتالي: الوحدة العسكرية
                    القائد الرتبه المنطقة العسكرية القائد العام للجيش العربي
                    الأردني جون باغوت جلوب جنرال (فريق أول) القيادة العامة
                    (الزرقاء) القائد الميداني نورمان لاش بريجاديير (عميد) اللواء
                    الأول ويتضمن الفوجين الأول والثالث ديزموند غولدي كولونيل
                    (عقيد) منطقة نابلس العسكرية الفوج الأول بلاكدين كولونيل
                    (عقيد) منطقة نابلس العسكرية الفوج الثالث ويليام نيومان
                    كولونيل (عقيد) منطقة نابلس العسكرية اللواء الثاني ويتضمن
                    الفوجين الخامس والسادس سام سيدني أرثر كوك بريجاديير (عميد)
                    قوة دعم الفوج الخامس جيمس هاوكن ميجور (رائد) قوة دعم الفوج
                    السادس عبد الله التل ميجور (رائد) منطقة القدس العسكرية
                    اللواء الثالث ويتضمن الفوجين الثاني والرابع تيل أشتون
                    كولونيل (عقيد) منطقة رام الله العسكرية الفوج الثاني سليد
                    ميجور (رائد) منطقة رام الله العسكرية الفوج الرابع حابس
                    المجالي لفتنانت كولونيل (مقدم) اللطرون، اللد والرملة اللواء
                    الرابع أحمد صدقي السيد كولونيل (عقيد) قوة دعم: رام الله،
                    الخليل، والرملة ومن ثم خاض الجيش الأردني ثلاث معارك كبيرة
                    هي: 1- معركة باب الواد 2- معركة اللطرون 3- معركة القدس
                    فاستطاع الحفاظ على القدس والضفة الغربية كاملة مع انتهاء
                    الحرب وكانت خسائر الإسرائيليين في هذه المعارك ضخمة، فقد قال
                    رئيس الوزراء الإسرائيلي ومؤسس إسرائيل ديفيد بن غوريون في
                    حزيران عام 1948 أمام الكنيست: «لقد خسرنا في معركة باب الواد
                    وحدها أمام الجيش الأردني ضعفي قتلانا في الحرب كاملة». وعلى
                    الجبهة الشمالية استولت القوات النظامية اللبنانية قريتي
                    المالكية وقَدَس في الجليل الأعلى جنوب الحدود اللبنانية.
                    واستمرت المعارك على هذا النحو حتى تدخّل مجلس الأمن التابع
                    للأمم الدولية وفرض عليها وقفا لإطلاق النار في 10 يونيو 1948
                    تتضمن حظر تزويد أي من أطراف الصراع بالأسلحة ومحاولة التوصل
                    إلى تسوية سلمية. المدفعية الأردنية تقصف مدينة القدس عقب هذا
                    القرار الدولي وقف القتال بين الجيش الإسرائيلي والجيوش
                    العربية النظامية أما جيش الإنقاذ فواصل عملياته العسكرية في
                    منطقة الجليل. تم تحديد الهدنة لمدة 4 أسابيع. وبالرغم من حظر
                    التسليح أو إرسال أي عدد جديد من القوات لجبهات القتال فإن
                    إسرائيل لم تلتزم مطلقاً بهذا الشرط وأخذت تسارع في تعويض
                    خسائرها وانهالت عليها الأسلحة بصورة ضخمة خصوصا الطائرات
                    وكذلك تطوّع الكثير من يهود أوروبا إلى الذهاب لجبهات القتال
                    وأيضا قامت إسرائيل بخرق الهدنة للتوسع في الأراضي التي
                    احتلتها حيث زحفت جنوباً من القطاع الشمالي عدد كبير من القوات
                    نحو الفالوجة التي ترابض فيها القوات المصرية لمحاولة كسب أرض
                    جديدة وكذلك تطويق الجيش المصري فيها لإضعاف الجبهة الجنوبية
                    التي كانت تقترب شيئا فشيئاً من تل أبيب وفي 8 يوليو 1948
                    استأنف الجيش الإسرائيلي القتال في جميع الجبهات رغم محاولات
                    الأمم المتحدة لتمديد مدة الهدنة. وعندما استؤنفت المعارك من
                    جديد كان للجيش الإسرائيلي اليد العليا واتخذت المعارك مسارا
                    مختلفا وتعرضت القوات العربية لسلسلة من الهزائم واستطاعت
                    إسرائيل فرض سيطرتها على مساحات واسعة من أراضي فلسطين
                    التاريخية. وانتهت المعارك في 21 يوليو بعد أن هدد مجلس الأمن
                    بفرض عقوبات قاسية على الجوانب المتقاتلة. قبل العرب الهدنة
                    الثانية التي كانت اعترافا بالهزيمة وتدخل حرب فلسطين التاريخ
                    العربي تحت اسم (النكبة). انتهى القتال في 7 يناير 1949 بعد
                    استيلاء الجيش الإسرائيلي على معظم منطقة النقب وتطويق القوات
                    المصرية التي كانت مرابطة حول الفالوجة في النقب الشمالي. وبعد
                    نهاية القتال بدأت مفاوضات في جزيرة رودس اليونانية بتوسيط
                    الأمم المتحدة بين إسرائيل من جانب وكل من مصر والأردن وسوريا
                    ولبنان من جانب آخر. تم التوقيع على اتفاقيات الهدنة الأربع
                    بين 24 فبراير و20 يوليو 1949، وفيها تم تحديد الخط الأخضر،
                    بينما لم يوقع العراق على الهدنة. في 7 مارس 1949 وصّى مجلس
                    الأمن بقبول إسرائيل عضوا كاملا في الأمم المتحدة وفي 11 مايو
                    1949 أقرت الجمعية العامة هذه التوصية.
                  </Typography>
                </AccordionDetails>
              </Accordion>
              <Accordion
                expanded={expanded === "panel3"}
                onChange={handleChange("panel3")}
              >
                <AccordionSummary
                  expandIcon={<ExpandMoreIcon />}
                  aria-controls="panel3bh-content"
                  id="panel3bh-header"
                >
                  <Typography sx={{ width: "33%", flexShrink: 0 }}>
                    بلدان فلسطين
                  </Typography>
                  <Typography sx={{ color: "text.secondary" }}>
                    تضم العديد من المدن الجميله و التاريخيه ...
                  </Typography>
                </AccordionSummary>
                <AccordionDetails>
                  <Typography>
                    محافظات فلسطين الخاضعة للسلطة الوطنية الفلسطينية المحافظة
                    المنطقة عدد السكان(2017) 1 جنين الضفة الغربية 314,866 2
                    طوباس والأغوار الشمالية الضفة الغربية 60,927 3 طولكرم الضفة
                    الغربية 186,760 4 نابلس الضفة الغربية 388,321 5 قلقيلية
                    الضفة الغربية 112,400 6 سلفيت الضفة الغربية 75,444 7 رام
                    الله والبيرة وروابي الضفة الغربية 328,861 8 أريحا الضفة
                    الغربية 50,002 9 القدس الضفة الغربية 435,483 10 بيت لحم
                    الضفة الغربية 217,400 11 الخليل الضفة الغربية 711,223 12
                    شمال غزة قطاع غزة 368,978 13 غزة قطاع غزة 652,597 14 دير
                    البلح (الوسطى) قطاع غزة 273,200 15 خان يونس قطاع غزة 269,601
                    16 رفح قطاع غزة 233,878 هذه قائمة مختصرة وتشمل بعض المدن
                    الرئيسية في فلسطين. هناك مدن أخرى في الضفة الغربية وقطاع
                    غزة، ولكل مدينة تاريخها وثقافتها الخاصة.
                  </Typography>
                </AccordionDetails>
              </Accordion>
            </div>
          </div>
        </Container>{" "}
      </div>
    </>
  );
}
