import { Container, Divider } from "@mui/material";
import React from "react";

export default function Israil() {
  return (
    <div style={{}}>
      <Container sx={{ marginBottom: 5 }}>
        <div className="h1" style={{ textAlign: "center" }}>
          <h1>نشأة الاحتلال الاسرائيلي وإشتعال الحرب في فلسطين</h1>
        </div>
        <div>
          <p>
            الكيان الصهيوني كيانٌ وظيفيٌ، أُنشئ بالتعاون مع قوى الاستعمار القديم
            من أجل إدامة السيطرة على المنطقة العربية، بصفتها قلب العالم
            الإسلامي، كما أنه كِيانٌ توسعيٌّ في أصل نشأته. يُعتقد عمومًا أن
            الصهيونية كحركة منظمة قد أسسها تيودور هرتزل عام 1897. لكن تاريخ
            الصهيونية بدأ، رغم ذلك، في وقت سابق ويرتبط باليهودية والتاريخ
            اليهودي. إذًا فالكيان الصهيوني -أو ما سمي بدولة ( (إسرائيل))- كان
            مشروعًا عدوانياً معقداً التقت فيه مصالح الدول الاستعمارية -وعلى
            رأسها بريطانيا- وطموحات العنصريين اليهود الأوربيين الذين خططوا
            لإنشاء الكيان اليهودي في فلسطين، أمثال هرتزل ووايزمان وروتشيلد،
            واستطاعوا في النهاية الحصول على وعد من الحكومة البريطانية بإقامة وطن
            قومي لليهود في فلسطين، بناءً على وعد بلفور الذي قطعته بريطانيا عام
            1917،
          </p>
        </div>
        <Divider />

        <div>
          <h3>الصراع العربي الإسرائيلي</h3>
          <p>
            يشير الصراع العربي الإسرائيلي إلى التوتر السياسي والصراعات العسكرية
            والنزاعات بين عدد من البلدان العربية ‌ وإسرائيل. إن جذور الصراع
            العربي الإسرائيلي مرتبطة في ظهور الصهيونية ‌والقومية العربية قرب
            نهاية القرن التاسع عشر. وينظر الفلسطينيين إلى الإقليم باعتباره وطنهم
            التاريخي الذي عاشوا فيه لآلاف السنين، في المقابل يعتبر اليهود بأنهم
            وعدوا بهذه الأرض وفقًا لنصوص في التوراة، وفي السياق الإسلامي، فإنها
            أراضي إسلامية. وقد نشأ الصراع الطائفي بين اليهود والعرب الفلسطينيين
            في أوائل القرن العشرين، وبلغ ذروته في حرب واسعة النطاق في عام 1947
            تخلله حملة تطهير عرقي وتهجير كبرى للفلسطينيين من قراهم ومدنهم، وتحول
            إلى الحرب العربية الإسرائيلية الأولى في مايو 1948 عقب إعلان قيام
            دولة إسرائيل. انتهت معظم الأعمال العدائية الواسعة النطاق باتفاقات
            وقف إطلاق النار بعد حرب أكتوبر 1973. ووقعت اتفاقات سلام بين إسرائيل
            ‌ومصر في عام 1979، مما إدى إلى انسحاب إسرائيل من شبه جزيرة سيناء
            وإلغاء نظام الحكم العسكري في الضفة الغربية و‌قطاع غزة، لصالح الإدارة
            المدنية الإسرائيلية وما ترتب عليه من ضم من جانب واحد لمرتفعات
            الجولان و‌القدس الشرقية. تحولت طبيعة الصراع على مر السنوات من الصراع
            العربي الإسرائيلي الإقليمي الواسع النطاق إلى صراع فلسطيني إسرائيلي
            محلي أكثر، بالغًا ذروته خلال حرب لبنان 1982. وقد أدت اتفاقيات أوسلو
            المؤقتة إلى إنشاء السلطة الوطنية الفلسطينية في عام 1994، في إطار
            عملية السلام الفلسطينية الإسرائيلية. وفي نفس العام، توصلت إسرائيل
            و‌الأردن إلى اتفاق سلام. تم الحفاظ على وقف إطلاق النار إلى حد كبير
            بين إسرائيل وسوريا، وكذلك في الآونة الأخيرة مع لبنان (منذ عام 2006).
            إلا أن التطورات التي حدثت في سياق الحرب الأهلية السورية قد بدل بصورة
            فعالة الحالة بالقرب من الحدود الشمالية الإسرائيلية مما جر الجمهورية
            العربية السورية، و‌حزب الله و‌المعارضة السورية إلى خلاف مع بعضهما
            البعض وعلاقات معقدة مع إسرائيل. الصراع بين إسرائيل وغزة الخاضعة
            لحركة حماس، الذي أسفر عن وقف إطلاق النار في عام 2014، يندرج عادة في
            إطار الصراع الفلسطيني الإسرائيلي فالصراع العربي الإسرائيلي. غير أن
            مرحلة 2006–2012، تعزى أيضًا إلى الحرب الإيرانية بالوكالة مع إسرائيل
            في المنطقة. وبين عامي 2012 و2017، قطعت إيران معظم علاقاتها مع حركة
            حماس السنية بسبب الحرب الأهلية السورية. على الرغم من اتفاقات السلام
            مع مصر والأردن، واتفاقيات السلام المؤقتة مع دولة فلسطين ووقف إطلاق
            النار القائم بصفة عامة، لا يزال العالم العربي وإسرائيل على خلاف مع
            بعضهما البعض بشأن العديد من المسائل.
          </p>
        </div>

        <Divider />
        <div>
          <h3>معركة الكرامة - حرب اكتوبر المجيده</h3>
          <p>
            هي حرب دارت بين مصر وسوريا من جهة والكيان الصهيونى من جهة أخرى في
            عام 1973 م. وتلقى الجيش الإسرائيلي ضربة قاسية في هذه الحرب حيث تم
            اختراق خط عسكري أساسي في شبه جزيرة سيناء وهو خط بارليف. وكان النجاح
            المصري ساحقا حتى 20 كم شرق القناة، وكان الرئيس المصري أنور السادات
            يعمل بشكل شخصي ومقرب مع قيادة الجيش السوري على التخطيط لهذه الحرب
            اما في سوريا فقد تقدمت القوات السورية حتى القنيطرة[؟] في الجولان إلا
            ان الهدوء بعد عدة أيام من الحرب على الجبهة المصرية جعل 80%من القوات
            الإسرائيلية[؟] تنتقل للجبهة السورية مما حدا بالجيش السوري للأنسحاب
            من معظم المناطق التي حررها ولا يُنسى أيضا دور الملك فيصل بن عبد
            العزيز والرئيس الجزائري هواري بومدين بقطع النفط على أمريكا[؟] وكل
            الدول التي تدعم الكيان الصهيوني إذ تزعم دول أوبك والخليج المصدرة
            للنفط كما ساهم في إمداد الجيش المصري والسوري بالأموال وتحريك صفقات
            السلاح للدولتين وأرسل بعض كتائب الجيش السعودي المدرب لسيناء والجولان
            للمساهمة في المجهود الحربي
          </p>
          <h3>نتائج الحرب</h3>
          <p>
            تدمير الجيش المصري خط بارليف، وتدمير الجيش السوري خط آلون. حظر النفط
            1973. استرداد السيادة الكاملة على قناة السويس. واسترداد جزء من
            الأراضي في شبه جزيرة سيناء وفي هضبة الجولان. عودة الملاحة في قناة
            السويس في حزيران 1975 م. وضع حد لأسطورة تفوق الجيش الإسرائيلي.
            اقتناع إسرائيل بضرورة تسوية الصراع العربي الإسرائيلي بالطرق
            السياسية.
          </p>
        </div>
        <Divider />
        <div>
          <h3>معاهدة السلام المصرية الإسرائيلية</h3>
          <p>
            قام الرئيس المصري محمد أنور السادات بإستغلال نتائج حرب تشرين الأول
            وبعد مبادرته بزيارة القدس في تشرين الثاني 1977 ، وقعت مصر وإسرائيل
            اتفاقيات كامب ديفيد[؟] في أيلول 1978 برعاية الولايات المتحدة
            الأمريكية والتي وضعت إطار للسلام بين البلدين، تبعها معاهدة السلام في
            26 آذار 1979.
          </p>
          <li>أول معاهدة سلام لإسرائيل مع دولة عربية.</li>
        <li>
          انسحاب إسرائيل الكامل من شبه جزيرة سيناء وجعلها منطقة منزوعة السلاح.
        </li>
        <li>السماح للسفن الإسرائيلية بالملاحة في القناة.</li>
        <li>حيدت هذه المعاهدة أكبر دولة عربية في النزاع العربي الإسرائيلى.</li>
        <li>تبادل السفارات بين البلدين.</li>
        <li>
          تتفاوض إسرائيل مع الأردن والفلسطينيين لمنح حكم ذاتي للضفة الغربية
          وقطاع غزة.
        </li>
        <li>
          قاطعت الدول العربية مصر لمبادرتها الفردية في السلام مع إسرائيل ونقل
          مقر جامعة الدول العربية إلى تونس وعادت العلاقات مرة أخرى مع بداية
          الثمانينات.
        </li>
        <li>
          تعاظم دور الولايات المتحدة في المنطقة على حساب الإتحاد السوفيتى.
        </li>
        <li>التطبيع بين مصر وإسرائيل في المجالات المختلفة.</li>
        <li>اقتسام السادات ومناحم بيجين جائزة نوبل للسلام.</li>
        </div>
       
      </Container>
    </div>
  );
}
