import { Container, Divider } from "@mui/material";
import React from "react";
import Photo1 from "../imageMap/1.jfif";
import Photo2 from "../imageMap/2.jfif";
import Photo3 from "../imageMap/3.jfif";
import Photo4 from "../imageMap/4.jfif";
import Photo5 from "../imageMap/5.jfif";
import Photo6 from "../imageMap/6.jfif";
import Photo7 from "../imageMap/7.jfif";
import Photo8 from "../imageMap/8.jfif";
import Photo9 from "../imageMap/9.jfif";

export default function Map1() {
  return (
    <div>
      <Container>
        <div>
          {" "}
          <h1>خرائط فلسطين</h1>
          <Divider />
          <p>
            علم رسم الخرائط في منطقة فلسطين، والمعروف أيضًا باسم علم رسم الخرائط
            في الأرض المقدسة، هو إنشاء وتحرير ومعالجة وطباعة الخرائط لمنطقة
            فلسطين من العصور القديمة حتى ظهور تقنيات المساحة الحديثة. وكانت لعدة
            قرون خلال العصور الوسطى هي الموضوع الأبرز في علم رسم الخرائط. يهيمن
            على تاريخ رسم خرائط فلسطين تقليدان لرسم الخرائط وهما المدرسة
            الكتابية والمدرسة الكلاسيكية، أقدم الخرائط المحفوظة من التقليد
            الكتابي تعود إلى محاولات آباء الكنيسة الأوائل لتحديد وتوضيح المواقع
            الأساسية المذكورة في الكتاب المقدس، وتوفير خرائط للحج المسيحي. أما
            أقدم الخرائط المحفوظة للمدرسة الكلاسيكية فتستمد من الأعمال العلمية
            والتاريخية في العالم اليوناني الروماني. إذ انتهت هيمنة التقليد
            الكتابي بعد اكتشاف الأوروبيين أعمال بطليموس في القرن الخامس عشر. وقد
            وصف العديد من الجغرافيين اليونانيين والرومان منطقة فلسطين في
            كتاباتهم. ومع ذلك لا توجد نسخ أصلية أو نسخ من هذه الخرائط موجودة قبل
            العصر الحديث والرسوم الموجودة اليوم للخرائط وفقًا للجغرافيين مثل
            هكتيوس الملطي، وهيرودوت، وإراتوستينس هي إعادات تجديدية حديثة. أما
            أقدم الخرائط الكلاسيكية المحفوظة للمنطقة، فهي نسخ بيزنطية لخريطة
            آسيا الرابعة لبطليموس. وبالتالي يبدأ التاريخ الخرائطي لفلسطين مع
            بطليموس، الذي استند عمله إلى عمل الجغرافي المحلي مارينوس الصوري.
          </p>
          <p>
            أُعدت أول قوائم للخرائط المتعلقة بالمنطقة في أواخر القرن التاسع عشر،
            حيث قام تيتوس توبلر في عام 1867 بإعداد "الفهرس الجغرافي لفلسطين"
            وبعدها قام رينهولد روريخت في عام 1890 بإعداد "مكتبة جغرافية
            لفلسطين". في سلسلة من المقالات التي نشرها رينهولد روريخت في "مجلة
            الجمعية الألمانية لدراسة فلسطين" بين عامي 1891 و1895، قدم التحليل
            المفصل الأول للخرائط المتعلقة بالمنطقة في العصور الوسطى وأواخر
            العصور الوسطى. وتبعهم في عامي 1939 و1940 كتاب "تاريخ رسم خرائط
            فلسطين" الذي أعده هانس فيشر. يتضمن هذا المقال قائمة بالخرائط التي
            ساهمت في تطور رسم الخرائط للمنطقة قبل ظهور تقنيات المساحة الحديثة،
            مما يوضح كيف تحسنت صناعة الخرائط والمساحة وساعدت الأجانب على فهم
            جغرافية المنطقة بشكل أفضل. تم استبعاد الخرائط الوهمية والنسخ من
            الخرائط الموجودة.
          </p>
          <a
            style={{
              fontSize: "20px",
              fontWeight: "bold",
              color: "#0288d1",
            }}
            href="https://www.google.com/maps/d/viewer?mid=1IS3O8YR4eFgE4QNZX7POjUMM2XM&ie=UTF8&msa=0&safe=on&ll=31.818850677606402%2C34.655733999999995&spn=2.219275%2C0.824758&source=embed&z=8"
          >
            الخريطة الحيوية لدولة فلسطين الحرة
          </a>
        </div>
        <Divider />

        <h3>بعض الخرائط</h3>
        <div
          style={{
            display: "flex",
            gap: 30,
            flexWrap: "wrap",
            margin: "30px 0",
          }}
        >
          <img alt="" src={Photo1} />
          <img alt="" src={Photo2} />
          <img alt="" src={Photo3} />
          <img alt="" src={Photo4} />
          <img alt="" src={Photo5} />
          <img alt="" src={Photo6} />
          <img alt="" src={Photo7} />
          <img alt="" src={Photo8} />
          <img alt="" src={Photo9} />
        </div>
        <div style={{ width: "50%" }}></div>
      </Container>
    </div>
  );
}
